# 6: Combining dataframe

When working with multiple datasets during a project, there will come a point where you might wish to merge your dataframes together to have a better view and understanding of your data. 

In this tutorial, we will cover two pandas functions, and they are [concat](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.concat.html) and [merge](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.merge.html) that are used to combine dataframes.

Note that you sometimes you will might see functions like [join](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.join.html) and [append](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.append.html#pandas.DataFrame.append) being used in other people's notebooks. However, I will not be discussing these two functions but just know they are the equivalent of concat and merge respectively.

I would recommend that you only learn concat and merge as they should be sufficient to handle all the scenarios that you will ever come across.

With that being said, let's proceed with the tutorial.

# Import pandas

In [52]:
import pandas as pd
import numpy as np
#from pandas.core.computation.check import NUMEXPR_INSTALLED

# Concat

Concat is short for concatenate. This function allows to stack two separate dataframes both vertically and horizontally.

Let's observe this with an example.

In [53]:
df1 = pd.DataFrame({'Name': ['Vicky', 'Bill'], 'Age': [12, 46]})
df2 = pd.DataFrame({'Name': ['John', 'Sabrina'], 'Age': [37, 25]})
df1

    Name  Age
0  Vicky   12
1   Bill   46

In [54]:
df2

      Name  Age
0     John   37
1  Sabrina   25

There is an argument called axis within the concat function that you can use to specify which way you would like to stack your dataframe. 1 means horizontal whereas 0 means vertical. If you do not specify, pandas assumes 0 as its default. 

You can also use the ignore index function if you would like a sequential index column in the new dataframe.

In [55]:
# Concat horizontally

pd.concat([df1, df2], axis = 1)

    Name  Age     Name  Age
0  Vicky   12     John   37
1   Bill   46  Sabrina   25

In [56]:
# Concat vertically and ignore index

df3 = pd.concat([df1, df2], axis = 0,ignore_index = True)
df3

      Name  Age
0    Vicky   12
1     Bill   46
2     John   37
3  Sabrina   25

There is another argument called join which allows you to stack dataframes only based on the columns shared by two dataframes.

To demonstrate this, suppose we have a new dataframe with an extra column for hobby.

In [57]:
df4 = pd.DataFrame({'Name': ['Tyler', 'Natalie'], 
                    'Age': [28, 39], 
                    'Hobby': ['Swimming', 'Reading']})
df4

      Name  Age     Hobby
0    Tyler   28  Swimming
1  Natalie   39   Reading

In [58]:
df3

      Name  Age
0    Vicky   12
1     Bill   46
2     John   37
3  Sabrina   25

In [59]:
pd.concat([df3, df4], axis=0, ignore_index=True)

      Name  Age     Hobby
0    Vicky   12       NaN
1     Bill   46       NaN
2     John   37       NaN
3  Sabrina   25       NaN
4    Tyler   28  Swimming
5  Natalie   39   Reading

In [60]:
# Outer (union) is the default for the join argument
pd.concat([df3, df4], join = 'outer', ignore_index = True)

      Name  Age     Hobby
0    Vicky   12       NaN
1     Bill   46       NaN
2     John   37       NaN
3  Sabrina   25       NaN
4    Tyler   28  Swimming
5  Natalie   39   Reading

In [61]:
df9 = pd.DataFrame({"adress": [14,48,78], "level": ["College", "School", "Employee"]})

df11 = pd.concat([df3,df9], join = "outer" , ignore_index=True)
print(df11["Age"].dtype)
df11

float64

      Name   Age  adress     level
0    Vicky  12.0     NaN       NaN
1     Bill  46.0     NaN       NaN
2     John  37.0     NaN       NaN
3  Sabrina  25.0     NaN       NaN
4      NaN   NaN    14.0   College
5      NaN   NaN    48.0    School
6      NaN   NaN    78.0  Employee

Outer does not consider any differences in columns between two dataframe. Because df3 does not have a hobby column, pandas will automatically fill them with null values.

In [62]:
# Inner stacks only the columns that are shared between the two dataframes
#Intersection 
pd.concat([df3, df4], join = 'inner', ignore_index = True)

      Name  Age
0    Vicky   12
1     Bill   46
2     John   37
3  Sabrina   25
4    Tyler   28
5  Natalie   39

Because df3 does not have the hobby column, pandas will not show that column in the combined dataframe.

# Merge

To demonstrate the idea of merge, let's first create two samples dataframe of a retail store. One for sales data and one for customer profile.

In [63]:
from datetime import date, timedelta

startingDate = date(2019, 7, 1)
endingDate = date(2020, 6, 30)
diff = endingDate - startingDate # 1

dates = []

for k in range(diff.days + 1): # end+1 --> 366
    dates.append(startingDate + timedelta(days = k))
    
print(dates)

[datetime.date(2019, 7, 1), datetime.date(2019, 7, 2), datetime.date(2019, 7, 3), datetime.date(2019, 7, 4), datetime.date(2019, 7, 5), datetime.date(2019, 7, 6), datetime.date(2019, 7, 7), datetime.date(2019, 7, 8), datetime.date(2019, 7, 9), datetime.date(2019, 7, 10), datetime.date(2019, 7, 11), datetime.date(2019, 7, 12), datetime.date(2019, 7, 13), datetime.date(2019, 7, 14), datetime.date(2019, 7, 15), datetime.date(2019, 7, 16), datetime.date(2019, 7, 17), datetime.date(2019, 7, 18), datetime.date(2019, 7, 19), datetime.date(2019, 7, 20), datetime.date(2019, 7, 21), datetime.date(2019, 7, 22), datetime.date(2019, 7, 23), datetime.date(2019, 7, 24), datetime.date(2019, 7, 25), datetime.date(2019, 7, 26), datetime.date(2019, 7, 27), datetime.date(2019, 7, 28), datetime.date(2019, 7, 29), datetime.date(2019, 7, 30), datetime.date(2019, 7, 31), datetime.date(2019, 8, 1), datetime.date(2019, 8, 2), datetime.date(2019, 8, 3), datetime.date(2019, 8, 4), datetime.date(2019, 8, 5), datetime.date(2019, 8, 6), datetime.date(2019, 8, 7), datetime.date(2019, 8, 8), datetime.date(2019, 8, 9), datetime.date(2019, 8, 10), datetime.date(2019, 8, 11), datetime.date(2019, 8, 12), datetime.date(2019, 8, 13), datetime.date(2019, 8, 14), datetime.date(2019, 8, 15), datetime.date(2019, 8, 16), datetime.date(2019, 8, 17), datetime.date(2019, 8, 18), datetime.date(2019, 8, 19), datetime.date(2019, 8, 20), datetime.date(2019, 8, 21), datetime.date(2019, 8, 22), datetime.date(2019, 8, 23), datetime.date(2019, 8, 24), datetime.date(2019, 8, 25), datetime.date(2019, 8, 26), datetime.date(2019, 8, 27), datetime.date(2019, 8, 28), datetime.date(2019, 8, 29), datetime.date(2019, 8, 30), datetime.date(2019, 8, 31), datetime.date(2019, 9, 1), datetime.date(2019, 9, 2), datetime.date(2019, 9, 3), datetime.date(2019, 9, 4), datetime.date(2019, 9, 5), datetime.date(2019, 9, 6), datetime.date(2019, 9, 7), datetime.date(2019, 9, 8), datetime.date(2019, 9, 9), datetime.date(2019, 9, 10), datetime.date(2019, 9, 11), datetime.date(2019, 9, 12), datetime.date(2019, 9, 13), datetime.date(2019, 9, 14), datetime.date(2019, 9, 15), datetime.date(2019, 9, 16), datetime.date(2019, 9, 17), datetime.date(2019, 9, 18), datetime.date(2019, 9, 19), datetime.date(2019, 9, 20), datetime.date(2019, 9, 21), datetime.date(2019, 9, 22), datetime.date(2019, 9, 23), datetime.date(2019, 9, 24), datetime.date(2019, 9, 25), datetime.date(2019, 9, 26), datetime.date(2019, 9, 27), datetime.date(2019, 9, 28), datetime.date(2019, 9, 29), datetime.date(2019, 9, 30), datetime.date(2019, 10, 1), datetime.date(2019, 10, 2), datetime.date(2019, 10, 3), datetime.date(2019, 10, 4), datetime.date(2019, 10, 5), datetime.date(2019, 10, 6), datetime.date(2019, 10, 7), datetime.date(2019, 10, 8), datetime.date(2019, 10, 9), datetime.date(2019, 10, 10), datetime.date(2019, 10, 11), datetime.date(2019, 10, 12), datetime.date(2019, 10, 13), datetime.date(2019, 10, 14), datetime.date(2019, 10, 15), datetime.date(2019, 10, 16), datetime.date(2019, 10, 17), datetime.date(2019, 10, 18), datetime.date(2019, 10, 19), datetime.date(2019, 10, 20), datetime.date(2019, 10, 21), datetime.date(2019, 10, 22), datetime.date(2019, 10, 23), datetime.date(2019, 10, 24), datetime.date(2019, 10, 25), datetime.date(2019, 10, 26), datetime.date(2019, 10, 27), datetime.date(2019, 10, 28), datetime.date(2019, 10, 29), datetime.date(2019, 10, 30), datetime.date(2019, 10, 31), datetime.date(2019, 11, 1), datetime.date(2019, 11, 2), datetime.date(2019, 11, 3), datetime.date(2019, 11, 4), datetime.date(2019, 11, 5), datetime.date(2019, 11, 6), datetime.date(2019, 11, 7), datetime.date(2019, 11, 8), datetime.date(2019, 11, 9), datetime.date(2019, 11, 10), datetime.date(2019, 11, 11), datetime.date(2019, 11, 12), datetime.date(2019, 11, 13), datetime.date(2019, 11, 14), datetime.date(2019, 11, 15), datetime.date(2019, 11, 16), datetime.date(2019, 11, 17), datetime.date(2019, 11, 18), datetime.date(2019, 11, 19), datetime.date(2019, 11, 20), datetime.date(2019, 11, 21), datetime.date(2019, 11, 22), datetime.date(2019, 11, 23), datetime.date(2019, 11, 24), datetime.date(2019, 11, 25), datetime.date(2019, 11, 26), datetime.date(2019, 11, 27), datetime.date(2019, 11, 28), datetime.date(2019, 11, 29), datetime.date(2019, 11, 30), datetime.date(2019, 12, 1), datetime.date(2019, 12, 2), datetime.date(2019, 12, 3), datetime.date(2019, 12, 4), datetime.date(2019, 12, 5), datetime.date(2019, 12, 6), datetime.date(2019, 12, 7), datetime.date(2019, 12, 8), datetime.date(2019, 12, 9), datetime.date(2019, 12, 10), datetime.date(2019, 12, 11), datetime.date(2019, 12, 12), datetime.date(2019, 12, 13), datetime.date(2019, 12, 14), datetime.date(2019, 12, 15), datetime.date(2019, 12, 16), datetime.date(2019, 12, 17), datetime.date(2019, 12, 18), datetime.date(2019, 12, 19), datetime.date(2019, 12, 20), datetime.date(2019, 12, 21), datetime.date(2019, 12, 22), datetime.date(2019, 12, 23), datetime.date(2019, 12, 24), datetime.date(2019, 12, 25), datetime.date(2019, 12, 26), datetime.date(2019, 12, 27), datetime.date(2019, 12, 28), datetime.date(2019, 12, 29), datetime.date(2019, 12, 30), datetime.date(2019, 12, 31), datetime.date(2020, 1, 1), datetime.date(2020, 1, 2), datetime.date(2020, 1, 3), datetime.date(2020, 1, 4), datetime.date(2020, 1, 5), datetime.date(2020, 1, 6), datetime.date(2020, 1, 7), datetime.date(2020, 1, 8), datetime.date(2020, 1, 9), datetime.date(2020, 1, 10), datetime.date(2020, 1, 11), datetime.date(2020, 1, 12), datetime.date(2020, 1, 13), datetime.date(2020, 1, 14), datetime.date(2020, 1, 15), datetime.date(2020, 1, 16), datetime.date(2020, 1, 17), datetime.date(2020, 1, 18), datetime.date(2020, 1, 19), datetime.date(2020, 1, 20), datetime.date(2020, 1, 21), datetime.date(2020, 1, 22), datetime.date(2020, 1, 23), datetime.date(2020, 1, 24), datetime.date(2020, 1, 25), datetime.date(2020, 1, 26), datetime.date(2020, 1, 27), datetime.date(2020, 1, 28), datetime.date(2020, 1, 29), datetime.date(2020, 1, 30), datetime.date(2020, 1, 31), datetime.date(2020, 2, 1), datetime.date(2020, 2, 2), datetime.date(2020, 2, 3), datetime.date(2020, 2, 4), datetime.date(2020, 2, 5), datetime.date(2020, 2, 6), datetime.date(2020, 2, 7), datetime.date(2020, 2, 8), datetime.date(2020, 2, 9), datetime.date(2020, 2, 10), datetime.date(2020, 2, 11), datetime.date(2020, 2, 12), datetime.date(2020, 2, 13), datetime.date(2020, 2, 14), datetime.date(2020, 2, 15), datetime.date(2020, 2, 16), datetime.date(2020, 2, 17), datetime.date(2020, 2, 18), datetime.date(2020, 2, 19), datetime.date(2020, 2, 20), datetime.date(2020, 2, 21), datetime.date(2020, 2, 22), datetime.date(2020, 2, 23), datetime.date(2020, 2, 24), datetime.date(2020, 2, 25), datetime.date(2020, 2, 26), datetime.date(2020, 2, 27), datetime.date(2020, 2, 28), datetime.date(2020, 2, 29), datetime.date(2020, 3, 1), datetime.date(2020, 3, 2), datetime.date(2020, 3, 3), datetime.date(2020, 3, 4), datetime.date(2020, 3, 5), datetime.date(2020, 3, 6), datetime.date(2020, 3, 7), datetime.date(2020, 3, 8), datetime.date(2020, 3, 9), datetime.date(2020, 3, 10), datetime.date(2020, 3, 11), datetime.date(2020, 3, 12), datetime.date(2020, 3, 13), datetime.date(2020, 3, 14), datetime.date(2020, 3, 15), datetime.date(2020, 3, 16), datetime.date(2020, 3, 17), datetime.date(2020, 3, 18), datetime.date(2020, 3, 19), datetime.date(2020, 3, 20), datetime.date(2020, 3, 21), datetime.date(2020, 3, 22), datetime.date(2020, 3, 23), datetime.date(2020, 3, 24), datetime.date(2020, 3, 25), datetime.date(2020, 3, 26), datetime.date(2020, 3, 27), datetime.date(2020, 3, 28), datetime.date(2020, 3, 29), datetime.date(2020, 3, 30), datetime.date(2020, 3, 31), datetime.date(2020, 4, 1), datetime.date(2020, 4, 2), datetime.date(2020, 4, 3), datetime.date(2020, 4, 4), datetime.date(2020, 4, 5), datetime.date(2020, 4, 6), datetime.date(2020, 4, 7), datetime.date(2020, 4, 8), datetime.date(2020, 4, 9), datetime.date(2020, 4, 10), datetime.date(2020, 4, 11), datetime.date(2020, 4, 12), datetime.date(2020, 4, 13), datetime.date(2020, 4, 14), datetime.date(2020, 4, 15), datetime.date(2020, 4, 16), datetime.date(2020, 4, 17), datetime.date(2020, 4, 18), datetime.date(2020, 4, 19), datetime.date(2020, 4, 20), datetime.date(2020, 4, 21), datetime.date(2020, 4, 22), datetime.date(2020, 4, 23), datetime.date(2020, 4, 24), datetime.date(2020, 4, 25), datetime.date(2020, 4, 26), datetime.date(2020, 4, 27), datetime.date(2020, 4, 28), datetime.date(2020, 4, 29), datetime.date(2020, 4, 30), datetime.date(2020, 5, 1), datetime.date(2020, 5, 2), datetime.date(2020, 5, 3), datetime.date(2020, 5, 4), datetime.date(2020, 5, 5), datetime.date(2020, 5, 6), datetime.date(2020, 5, 7), datetime.date(2020, 5, 8), datetime.date(2020, 5, 9), datetime.date(2020, 5, 10), datetime.date(2020, 5, 11), datetime.date(2020, 5, 12), datetime.date(2020, 5, 13), datetime.date(2020, 5, 14), datetime.date(2020, 5, 15), datetime.date(2020, 5, 16), datetime.date(2020, 5, 17), datetime.date(2020, 5, 18), datetime.date(2020, 5, 19), datetime.date(2020, 5, 20), datetime.date(2020, 5, 21), datetime.date(2020, 5, 22), datetime.date(2020, 5, 23), datetime.date(2020, 5, 24), datetime.date(2020, 5, 25), datetime.date(2020, 5, 26), datetime.date(2020, 5, 27), datetime.date(2020, 5, 28), datetime.date(2020, 5, 29), datetime.date(2020, 5, 30), datetime.date(2020, 5, 31), datetime.date(2020, 6, 1), datetime.date(2020, 6, 2), datetime.date(2020, 6, 3), datetime.date(2020, 6, 4), datetime.date(2020, 6, 5), datetime.date(2020, 6, 6), datetime.date(2020, 6, 7), datetime.date(2020, 6, 8), datetime.date(2020, 6, 9), datetime.date(2020, 6, 10), datetime.date(2020, 6, 11), datetime.date(2020, 6, 12), datetime.date(2020, 6, 13), datetime.date(2020, 6, 14), datetime.date(2020, 6, 15), datetime.date(2020, 6, 16), datetime.date(2020, 6, 17), datetime.date(2020, 6, 18), datetime.date(2020, 6, 19), datetime.date(2020, 6, 20), datetime.date(2020, 6, 21), datetime.date(2020, 6, 22), datetime.date(2020, 6, 23), datetime.date(2020, 6, 24), datetime.date(2020, 6, 25), datetime.date(2020, 6, 26), datetime.date(2020, 6, 27), datetime.date(2020, 6, 28), datetime.date(2020, 6, 29), datetime.date(2020, 6, 30)]

In [64]:
start_date = date(2025, 2 , 1)
for i in range(24):
    current_Date = start_date + timedelta(days=i)

print(current_Date)

2025-02-24

In [65]:
start_date = date(2025, 2 , 1)
current_Date = start_date + timedelta(days=23)
print(current_Date)

2025-02-24

The choices() method returns a list with the randomly selected element from the specified sequence.

You can weigh the possibility of each result with the weights parameter or the cum_weights parameter.

The sequence can be a string, a range, a list, a tuple or any other kind of sequence.

In [66]:
# Create two dataframes, one for sales and one for customer profile

import random
import datetime

lifestage = ['Young', 'Adults', 'Family', 'Senior']

stores = ['Melbourne CBD', 'Carlton', 'Fitzroy', 'Collingwood',
          'Richmond', 'Doncaster', 'Kew', 'Prahran', 
          'South Yarra', 'Docklands', 'Bundoora', 'Ivanhoe',
          'Glen Waverly', 'Dandenong', 'Frankston']  

sales = pd.DataFrame({'Date': random.choices(dates, k = 1000), 
                      'Customer ID': random.choices(list(range(1, 101)), k = 1000), 
                      'Store': random.choices(stores, k = 1000), 
                      'Sales': random.choices(list(range(1, 101)), k = 1000)})


customers = pd.DataFrame({'Customer ID': list(range(1, 101)), 
                          'Customer Lifestage': random.choices(lifestage, k = 100)})

# Let's look at sales
sales

           Date  Customer ID        Store  Sales
0    2020-04-16           54  Collingwood     86
1    2020-06-04           21      Ivanhoe    100
2    2019-07-11           91      Prahran     21
3    2019-10-18            4     Bundoora     10
4    2019-11-22           17     Richmond      2
..          ...          ...          ...    ...
995  2019-07-03           77      Carlton     46
996  2019-10-28           39    Dandenong     30
997  2020-01-29           40     Bundoora     45
998  2019-12-05            9  South Yarra     53
999  2020-04-26           95      Ivanhoe     75

[1000 rows x 4 columns]

In [67]:
customers

    Customer ID Customer Lifestage
0             1              Young
1             2             Family
2             3             Family
3             4              Young
4             5              Young
..          ...                ...
95           96             Senior
96           97             Senior
97           98             Senior
98           99             Senior
99          100             Family

[100 rows x 2 columns]

In [68]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Date         1000 non-null   object
 1   Customer ID  1000 non-null   int64
 2   Store        1000 non-null   object
 3   Sales        1000 non-null   int64
dtypes: int64(2), object(2)
memory usage: 31.4+ KB

In [69]:
customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 2 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Customer ID         100 non-null    int64
 1   Customer Lifestage  100 non-null    object
dtypes: int64(1), object(1)
memory usage: 1.7+ KB

In [70]:
# Date is not in order so sort data by date

sales.sort_values(by = 'Date', inplace = True, ignore_index = True)
sales

           Date  Customer ID          Store  Sales
0    2019-07-01           36      Dandenong     11
1    2019-07-01           87  Melbourne CBD     41
2    2019-07-01           53    Collingwood     35
3    2019-07-01           13        Ivanhoe     82
4    2019-07-02           66  Melbourne CBD     21
..          ...          ...            ...    ...
995  2020-06-28           14      Docklands      6
996  2020-06-29           99      Docklands     11
997  2020-06-29           75      Frankston     11
998  2020-06-29           98       Bundoora      5
999  2020-06-30           17        Carlton      7

[1000 rows x 4 columns]

In [71]:
# There are 100 unique customer ID which means that they are unique to each row

customers['Customer ID'].nunique()

100

In [72]:
sales['Customer ID'].nunique()

100

In [73]:
# Select sales made by customer with customer ID number 1

sales.loc[sales['Customer ID'] == 1, :].head()

           Date  Customer ID          Store  Sales
59   2019-07-24            1      Frankston     58
125  2019-08-11            1  Melbourne CBD      6
143  2019-08-17            1            Kew     33
257  2019-09-30            1  Melbourne CBD     43
268  2019-10-04            1        Carlton      1

In [74]:
customers.loc[customers['Customer ID'] == 1, :].head()

   Customer ID Customer Lifestage
0            1              Young

In [75]:
# Merge the two dataframes together
combined = pd.merge(sales, customers)
combined

           Date  Customer ID          Store  Sales Customer Lifestage
0    2019-07-01           36      Dandenong     11             Family
1    2019-07-15           36            Kew     88             Family
2    2019-08-03           36      Docklands     28             Family
3    2019-08-11           36        Fitzroy     10             Family
4    2019-09-26           36            Kew     80             Family
..          ...          ...            ...    ...                ...
995  2020-06-10           97      Frankston     18             Senior
996  2020-03-08           15        Carlton     64             Senior
997  2020-03-09           15   Glen Waverly     26             Senior
998  2020-05-21           15      Frankston     89             Senior
999  2020-05-26           15  Melbourne CBD     43             Senior

[1000 rows x 5 columns]

In [76]:
combined['Customer Lifestage'].isnull().sum()

0

In [77]:
print("Shape of sales data is: ", sales.shape)
print("Shape of customer data is: ", customers.shape)
print("Shape of the combined dataframe is: ", combined.shape)

Shape of sales data is:  (1000, 4)
Shape of customer data is:  (100, 2)
Shape of the combined dataframe is:  (1000, 5)

In [78]:
combined.loc[combined['Customer ID'] == 1, :]

           Date  Customer ID          Store  Sales Customer Lifestage
483  2019-07-24            1      Frankston     58              Young
484  2019-08-11            1  Melbourne CBD      6              Young
485  2019-08-17            1            Kew     33              Young
486  2019-09-30            1  Melbourne CBD     43              Young
487  2019-10-04            1        Carlton      1              Young
488  2020-03-25            1      Dandenong     69              Young
489  2020-03-28            1      Dandenong     75              Young
490  2020-03-29            1       Richmond      2              Young
491  2020-04-16            1        Carlton      9              Young
492  2020-05-02            1   Glen Waverly     94              Young
493  2020-05-11            1      Doncaster      5              Young
494  2020-06-25            1        Carlton     21              Young

As we can see, merge has successfully joined the two dataframes together based on a shared column which is customer ID.

The combined dataframe has the same number of rows as the sales dataframe but with an additional column, customer lifestage which came from the customer dataframe.

Now, we are going to explore the how argument within the merge function which allows you to specify the direction in which you would like to merge your dataframes.

In [79]:
size = pd.DataFrame({'Color': ['Red', 'Blue', 'Green'], 'Size': ['M', 'S', 'L']})
gender = pd.DataFrame({'Color': ['Red', 'Blue', 'Yellow'], 'Gender': ['Female', 'Female', 'Male']})
size

   Color Size
0    Red    M
1   Blue    S
2  Green    L

In [80]:
gender

    Color  Gender
0     Red  Female
1    Blue  Female
2  Yellow    Male

Inner and outer are very similar to what we have seen in the concat section earlier in this notebook.

In [81]:
# Only show rows where there is a match in the column
# Red and blue are present in both dataframes

pd.merge(size, gender, how = 'inner')  #Intersection

  Color Size  Gender
0   Red    M  Female
1  Blue    S  Female

In [82]:
# Show all the rows and fill rows with null values when there is no match
# There is no sex info on green colour and there is no size info on yellow colour

pd.merge(size, gender, how = 'outer')  # Union

    Color Size  Gender
0     Red    M  Female
1    Blue    S  Female
2   Green    L     NaN
3  Yellow  NaN    Male

Left and right on the other hand allows you to specify which dataframe to keep when there is no matching rows.

In [83]:
size

   Color Size
0    Red    M
1   Blue    S
2  Green    L

In [84]:
gender

    Color  Gender
0     Red  Female
1    Blue  Female
2  Yellow    Male

In [85]:
# Keep everything that is on the left dataframe which is df1 in this example
# Fill in sex info for rows that have matches with df2 and if there is none e.g. green colour, fill null value

pd.merge(size, gender, how = 'left') #size - gender (difference rule in set theory)

   Color Size  Gender
0    Red    M  Female
1   Blue    S  Female
2  Green    L     NaN

In [86]:
# Keep everything that is on the right dataframe which is df2 in this example
# Fill in size info for rows that have matches with df1 and if there is none e.g. yellow colour, fill null value

pd.merge(size, gender, how = 'right') #gender - size

    Color Size  Gender
0     Red    M  Female
1    Blue    S  Female
2  Yellow  NaN    Male